################################################
#            Translatable strings              #
################################################

# Hard-coded strings

sampleText1=Przet\u0142umaczalny tekst na pierwszym kafelku.
sampleText2=Przet\u0142umaczalny tekst na ostatnim kafelku.
test1=Tekst testowy 1
test2=en++ init

# Composite Messages

dropdownListLabel=Zaktualizuj aplikacj\u0119
dropdownListItem1Text=o dowolnym czasie
dropdownListItem2Text=co 3 miesi\u0105ce
dropdownListItem3Text=co 6 miesi\u0119cy
dropdownListItem4Text=co roku

#Concatenations

lastEntriesNumberLabel=Liczba ostatnich wpis\u00F3w
totalEntriesNumberLabel=Liczba wszystkich wpis\u00F3w
numberFieldValidationError=Wprowadzona warto\u015B\u0107 musi by\u0107 liczb\u0105 i nie mo\u017Ce przekracza\u0107 5000.

concatenatedString1=Pobieranie ostatniego
concatenatedString2=z
concatenatedString3=wpis\u00F3w.

fullSentenceMessage=Pobieranie ostatniego {0} z {1} wpis\u00F3w.

#Truncated strings

truncatedStringsLabel=Wpisz tekst tutaj
truncatedStringsButtonText=Poka\u017C tekst na przycisku

#################################################
# App Descriptor for Fiori Launchpad (FLP) tile #
#################################################

appTitle=i18n demo app
appDescription=Prosta aplikacja demo dla typowych i18n problem\u00F3w

# Page title

panelHeaderText=i18n Problemy T\u0142umaczeniowe Demo

changeLocaleLabel=Wpisz sw\u00F3j j\u0119zyk
changeLocaleButton=Zmie\u0144 j\u0119zyk
changeLocaleInformation=Je\u015Bli nie ma t\u0142umacze\u0144 dla danego j\u0119zyka, pr\u00F3bki i18n b\u0119d\u0105 wy\u015Bwietlane w j\u0119zyku angielskim.

genericActionDescription=Zwizualizuj problem i18n w swoim j\u0119zyku! Przejd\u017A do TEW, przet\u0142umacz plik i18n.properties resource i wy\u015Bwietl poni\u017Cszy przyk\u0142ad w swoim j\u0119zyku.

# Hard-coded strings

hardCodedStringsTab=Twardy kod
hardCodedStringsIssueDescription=Twardy kod b\u0119dzie zawsze wy\u015Bwietlany w oryginalnym j\u0119zyku, chocia\u017C zmieni\u0142 si\u0119 j\u0119zyk aplikacji.
hardCodedStringsAfterActionDescription=Po przet\u0142umaczeniu ci\u0105g \u015Brodkowej p\u0142ytki pozostanie w j\u0119zyku angielskim.

# Composite Messages

compositeMessagesTab=Wiadomo\u015Bci Z\u0142o\u017Cone
compositeMessagesIssueDescription=Z\u0142o\u017Cone komunikaty podobne do zda\u0144 przyjmuj\u0105 okre\u015Blon\u0105 kolejno\u015B\u0107 s\u0142\u00F3w w zdaniu, kt\u00F3re mog\u0105 wymaga\u0107 innej w innym j\u0119zyku.
compositeMessagesAfterActionDescription=W zale\u017Cno\u015Bci od j\u0119zyka mo\u017Cesz zmieni\u0107 uk\u0142ad opisu etykiety i listy rozwijanej, aby uzyska\u0107 dobre t\u0142umaczenie. Poniewa\u017C nie jest to mo\u017Cliwe, musisz przeredagowa\u0107 teksty u\u017Cytkownika, aby rozwi\u0105za\u0107 ten problem.

#Concatenations

concatenationsTab=Konkatenacje
concatenationsIssueDescription=Wiadomo\u015Bci z\u0142o\u017Cone sk\u0142adaj\u0105ce si\u0119 z niekompletnych ci\u0105g\u00F3w (konkatenacji) nie mog\u0105 by\u0107 zmieniane przez t\u0142umacza.
concatenationsAfterActionDescription=W tym przyk\u0142adzie istniej\u0105 dwa sposoby tworzenia ci\u0105gu komunikat\u00F3w.n Przez po\u0142\u0105czenie r\u00F3\u017Cnych ci\u0105g\u00F3w i zmiennych: "concatenatedString1 + <lastEntriesNumber> + concatenatedString2 + <totalEntriesNumber> + concatenatedString3"\n Przez zast\u0105pienie ponumerowanych zmiennych w pe\u0142nym zdaniu: "Pobieranie ostatnich {0} z {1} wpis\u00F3w". \n Je\u015Bli kolejno\u015B\u0107 wiadomo\u015Bci w Twoim j\u0119zyku musi zosta\u0107 ponownie uporz\u0105dkowana w taki spos\u00F3b, aby ca\u0142kowita liczba wpis\u00F3w by\u0142a wymieniona przed liczb\u0105 ostatnich wpis\u00F3w, komunikat wy\u015Bwietlany po klikni\u0119ciu pierwszego przycisku nie b\u0119dzie ju\u017C poprawny.
concatenatedStringButtonText=Show message as concatenated string
concatenatedStringSolutionsButtonText=Show message as full sentence with variables
concatenationsSolutionDescription=Use full sentences and numbered variables to avoid this issue.

#Truncated strings

truncatedStringsTab=Obci\u0119te kody
truncatedStringsIssueDescription=Kody przekraczaj\u0105ce szeroko\u015B\u0107 elementu interfejsu u\u017Cytkownika s\u0105 obcinane w aplikacji.
truncatedStringsActionDescription=Wpisz kod o dowolnej d\u0142ugo\u015Bci w polu wej\u015Bciowym i kliknij przycisk.
truncatedStringsAfterActionDescription=Je\u015Bli kod przekracza okre\u015Blon\u0105 d\u0142ugo\u015B\u0107, b\u0119dzie wygl\u0105da\u0142 na obci\u0119ty w elemencie u\u017Cytkownika.
truncatedStringsSolutionDescription=Add length restriction meta-data to your resource files for translation or delegate layout calculations to auto-layout systems.

