################################################
#            Translatable strings              #
################################################

# Hard-coded strings
sampleText1=Texto traducible en el primer mosaico.
sampleText2=Texto traducible en el \u00FAltimo mosaico.
newstring=New string - test


# Composite Messages
dropdownListLabel=Update the application
#NOTR
test=Test text
# NOTR
test1=Test text1
dropdownListItem1Text=en cualquier momento
dropdownListItem2Text=cada 3 meses
dropdownListItem3Text=cada 6 meses
dropdownListItem4Text=Cada a\u00F1o

#Concatenations

lastEntriesNumberLabel=Cantidad de \u00FAltimas entradas
totalEntriesNumberLabel=Cantidad de entradas totales
numberFieldValidationError=El valor introducido debe ser un n\u00FAmero y no debe exceder 5000.

# NOTR
concatenatedString1=Retrieving last
concatenatedString2=de
concatenatedString3=entradas.

fullSentenceMessage=Recuperando la \u00FAltima {0} de {1} entradas.

#Truncated strings

truncatedStringsLabel=Escriba alg\u00FAn texto aqu\u00ED:
truncatedStringsButtonText=Mostrar el texto en bot\u00F3n

#################################################
# App Descriptor for Fiori Launchpad (FLP) tile #
#################################################


appTitle=Aplicaci\u00F3n de demostraci\u00F3n sobre internaizci\u00F3n

appDescription=Una simple aplicaci\u00F3n de demostraci\u00F3n de errores de internacionalizaci\u00F3n t\u00EDpicos

# Page title


panelHeaderText=Errores de internacionalizaci\u00F3n en la traducci\u00F3n -Demostraci\u00F3n


# NOTR
changeLocaleLabel=Type in your locale

changeLocaleButton=Cambie su configuraci\u00F3n regional

changeLocaleInformation=Si no hay ninguna traducci\u00F3n para la configuraci\u00F3n regional indicada, las muestras i18n se mostrar\u00E1n en ingl\u00E9s.


genericActionDescription=Visualice el problema i18n en su idioma. Vaya al TEW, traduzca el fichero de recursos i18n.properties y visualice la muestra que aparece a continuaci\u00F3n en su configuraci\u00F3n local.

# Hard-coded strings

hardCodedStringsTab=Cadenas de codificaci\u00F3n fija

hardCodedStringsIssueDescription=Las cadenas codificadas de forma fija siempre se mostrar\u00E1n en el idioma original aunque la configuraci\u00F3n regional de la aplicaci\u00F3n se haya modificado.

hardCodedStringsAfterActionDescription=Despu\u00E9s de la traducci\u00F3n, la cadena del mosaico del centro permanecer\u00E1 en ingl\u00E9s.

# Composite Messages


compositeMessagesTab=Mensages compuestos

compositeMessagesIssueDescription=Los mensajes compuestos, como compuestos por sat\u00E9lite, suponen un orden particular para las palabras en una oraci\u00F3n que puede tener que ser diferente en otro idioma.

compositeMessagesAfterActionDescription=Dependiendo de su idioma, es posible que desee modificar el acuerdo de la descripci\u00F3n de la etiqueta y la lista desplegable para conseguir una buena traducci\u00F3n. Como esto no es posible, necesita reformular los textos de IU para resolver este problema.

#Concatenations


concatenationsTab=Conctenaciones

concatenationsIssueDescription=El traductor no puede volver a ordenar los mensajes compuestos que consisten en cadenas incompletas (concatenaciones).

concatenationsAfterActionDescription=En este ejemplo hay dos maneras de crear la cadena de mensajes.\n Mediante la concatenaci\u00F3n de varias cadenas y variables: "concatenatedString1 + <lastEntriesNumber> + concatenatedString2 + <totalEntriesNumber> + concatenatedString3"\n mediante la sustituci\u00F3n de variables numeradas en una oraci\u00F3n completa: "Recuperando las \u00FAltimas {0} de {1} entradas."\n Si el mensaje se debe volver a ordenar en su idioma de forma que el n\u00FAmero total de entradas se mencione antes de la cantidad de \u00FAltimas entradas, el mensaje que aparece al hacer clic en el primer bot\u00F3n ya no ser\u00E1 correcto.

concatenatedStringButtonText=Mostrar mensaje como cadena concatenada

concatenatedStringSolutionsButtonText=Mostrar mensaje como frase completa con variables

concatenationsSolutionDescription=Utilice frases completas y variables numeradas para evitar este problema.

#Truncated strings


truncatedStringsTab=Cadenas truncadas

truncatedStringsIssueDescription=Las cadenas que exceden el ancho de un elemento de UI aparecen truncadas en la aplicaci\u00F3n.

truncatedStringsActionDescription=Escriba una cadena de longitud arbitraria en el campo de entrada y haga clic en el bot\u00F3n.

truncatedStringsAfterActionDescription=Si la cadena supera una longitud determinada, aparecer\u00E1 truncada en el elemento de UI.

truncatedStringsSolutionDescription=A\u00F1ada metadatos de restricci\u00F3n de longitud a los archivos de recursos para los c\u00E1lculos de dise\u00F1o de traducci\u00F3n o delegar en sistemas de dise\u00F1o autom\u00E1tico.

